#include <stdint.h>
#include <stdio.h>

void divide(uint32_t N0) {
  uint32_t N = N0;
  printf("%d =",N0);
  /* просьба не предлагать излишнюю оптимизацию с sqrt() */
  for(uint32_t k = 2; (k <= N0/2) && (N > 1);) {
    if (N % k == 0) { if(N != N0) printf(" *"); N /= k; printf(" %d",k); }
    else k++;
  }
  printf("\n");
}

int main() {
  /* Разложить на множители все составные числа, т.е. которые имеют больше */
  /* двух делителей; два делителя (1 и N) имеют т.н. "простые" числа */
  for(uint32_t N0 = 1; N0 <= 6000; N0++)
    divide(N0);
  return 0;
}

/* 

	1 =
	2 =
	3 =
	4 = 2 * 2
	5 =
	6 = 2 * 3
	7 =
	8 = 2 * 2 * 2
	9 = 3 * 3
	10 = 2 * 5
	11 =
	12 = 2 * 2 * 3
	13 =
	14 = 2 * 7
	15 = 3 * 5
	16 = 2 * 2 * 2 * 2
	17 =
	....

*/
